In [10]:
person_nodes = (
    tp.spanner.overlap_join(persons["person"], nodes["span"],
                            "person", "span")
    .merge(nodes)
)
person_nodes

                             person                       span   id
0  [1288, 1304): 'Daniel Hernandez'     [1288, 1294): 'Daniel'  233
1  [1288, 1304): 'Daniel Hernandez'  [1295, 1304): 'Hernandez'  234
2       [1838, 1849): 'Curren Katz'     [1838, 1844): 'Curren'  335
3       [1838, 1849): 'Curren Katz'       [1845, 1849): 'Katz'  336
4        [2476, 2486): 'Ritu Jyoti'       [2476, 2480): 'Ritu'  462
5        [2476, 2486): 'Ritu Jyoti'      [2481, 2486): 'Jyoti'  463